Documents/НачислениеРКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>НачислениеРКО</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БюджетПоМесяцам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяБазыНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВычета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентВычета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНачисления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодПроекта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодЗадачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗадачаПроекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБазаРаспределения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВычета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисленоВычета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/БюджетПоМесяцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>БюджетПоМесяцам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РКО</Name>
					<Comment>Факт облагается РКО</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗадачаПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяСметы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипСуммыБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипСуммыБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипСуммыБюджета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>План</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПервичныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/НачислениеРКО/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	Объект.ПериодРегистрации = НачалоМесяца( Объект.ПериодРегистрации );
КонецПроцедуры


#Область Начисление

//&НаСервере
//Процедура ЗаполнитьТаблицуНачисления()
//	Док = РеквизитФормыВЗначение("Объект");
//	Док.Начисление.Очистить();
//	
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	СУММА(ВЫБОР
//		|			КОГДА БюджетПоМесяцам.СтатьяСметы = &СтатьяБазы
//		|				ТОГДА БюджетПоМесяцам.Сумма
//		|			ИНАЧЕ 0
//		|		КОНЕЦ) КАК СуммаБазаРаспределения,
//		|	СУММА(ВЫБОР
//		|			КОГДА БюджетПоМесяцам.СтатьяСметы = &СтатьяНачисления
//		|				ТОГДА БюджетПоМесяцам.Сумма
//		|			ИНАЧЕ 0
//		|		КОНЕЦ) КАК СуммаРанее,
//		|	БюджетПоМесяцам.ЗадачаПроекта,
//		|	СУММА(0) КАК СуммаВычета,
//		|	СУММА(0) КАК СуммаНачислено,
//		|	СУММА(0) КАК СуммаНачисленоВычета
//		|ИЗ
//		|	РегистрНакопления.БюджетПоМесяцам КАК БюджетПоМесяцам
//		|ГДЕ
//		|	БюджетПоМесяцам.Месяц = &ПериодРегистрации
//		|	И БюджетПоМесяцам.ЗадачаПроекта.Владелец.ГодПроекта = &ГодПроекта
//		|	И (БюджетПоМесяцам.СтатьяСметы = &СтатьяБазы
//		|			ИЛИ БюджетПоМесяцам.СтатьяСметы = &СтатьяНачисления)
//		|	И БюджетПоМесяцам.ТипСуммы = &ТипСуммы
//		|	И БюджетПоМесяцам.РКО
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	БюджетПоМесяцам.ЗадачаПроекта";
//	
//	Запрос.УстановитьПараметр("ГодПроекта", 			Объект.ГодПроекта);
//	Запрос.УстановитьПараметр("ПериодРегистрации", 		НачалоМесяца(Объект.ПериодРегистрации));
//	Запрос.УстановитьПараметр("СтатьяБазы", 			Объект.СтатьяБазыНачисления);
//	Запрос.УстановитьПараметр("СтатьяНачисления", 		Объект.СтатьяНачисления);
//	Запрос.УстановитьПараметр("ТипСуммы", 				Перечисления.ТипСуммыБюджета.Факт );
//	//Запрос.УстановитьПараметр("ПроцентНачисления", 		Объект.ПроцентНачисления/100);
//	
//	РезультатЗапроса 	= Запрос.Выполнить().Выгрузить();
//	МассивКоэфф 		= РезультатЗапроса.ВыгрузитьКолонку("СуммаБазаРаспределения");
//	Если Объект.СуммаВычета <> 0 Тогда
//		мВычеты				= РаспределитьПропорционально( Объект.СуммаВычета, 	МассивКоэфф);
//	КонецЕсли;
//	Для Каждого СтрРЗ ИЗ РезультатЗапроса Цикл
//		Индекс					= РезультатЗапроса.Индекс(СтрРЗ);
//		Если Объект.СуммаВычета <> 0 Тогда
//			СтрРЗ.СуммаВычета 		= мВычеты[Индекс];
//		КонецЕсли;
//		// %
//		СтрРЗ.СуммаНачислено		= Окр( (СтрРЗ.СуммаБазаРаспределения - СтрРЗ.СуммаВычета) * Объект.ПроцентНачисления/100, 2);
//		СтрРЗ.СуммаНачисленоВычета	= Окр( СтрРЗ.СуммаВычета * Объект.ПроцентВычета/100, 2);
//	КонецЦикла;
//	
//	
//	Док.Начисление.Загрузить( РезультатЗапроса );
//	Док.СуммаДокумента = РезультатЗапроса.Итог("СуммаНачислено") + РезультатЗапроса.Итог("СуммаНачисленоВычета");
//	
//	ЗначениеВРеквизитФормы(Док, "Объект");
//КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНачисления_Уст()
	Док = РеквизитФормыВЗначение("Объект");
	Док.Начисление.Очистить();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА БюджетПоМесяцам.СтатьяСметы = &СтатьяБазы
		|				ТОГДА БюджетПоМесяцам.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаБазаРаспределения,
		|	СУММА(ВЫБОР
		|			КОГДА БюджетПоМесяцам.СтатьяСметы = &СтатьяНачисления
		|				ТОГДА БюджетПоМесяцам.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаРанее,
		|	БюджетПоМесяцам.ЗадачаПроекта,
		|	СУММА(0) КАК СуммаВычета,
		|	СУММА(0) КАК СуммаНачислено,
		|	СУММА(0) КАК СуммаНачисленоВычета
		|ИЗ
		|	РегистрНакопления.БюджетПоМесяцам КАК БюджетПоМесяцам
		|ГДЕ
		|	БюджетПоМесяцам.Месяц = &ПериодРегистрации
		|	И БюджетПоМесяцам.ЗадачаПроекта.Владелец.ГодПроекта = &ГодПроекта
		|	И (БюджетПоМесяцам.СтатьяСметы = &СтатьяБазы
		|			ИЛИ БюджетПоМесяцам.СтатьяСметы = &СтатьяНачисления)
		|	И БюджетПоМесяцам.ТипСуммы = &ТипСуммы
		|	И БюджетПоМесяцам.РКО
		|	И (&ГодЗадачи = 0
		|			ИЛИ ВЫБОР
		|				КОГДА БюджетПоМесяцам.ЗадачаПроекта.НачалоРабот = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА БюджетПоМесяцам.ЗадачаПроекта.Владелец.ГодПроекта
		|				ИНАЧЕ ГОД(БюджетПоМесяцам.ЗадачаПроекта.НачалоРабот)
		|			КОНЕЦ = &ГодЗадачи)
		|
		|СГРУППИРОВАТЬ ПО
		|	БюджетПоМесяцам.ЗадачаПроекта";
	
	Запрос.УстановитьПараметр("ГодПроекта", 			Объект.ГодПроекта);
	Запрос.УстановитьПараметр("ГодЗадачи", 				Объект.ГодЗадачи);
	Запрос.УстановитьПараметр("ПериодРегистрации", 		НачалоМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("СтатьяБазы", 			Объект.СтатьяБазыНачисления);
	Запрос.УстановитьПараметр("СтатьяНачисления", 		Объект.СтатьяНачисления);
	Запрос.УстановитьПараметр("ТипСуммы", 				Перечисления.ТипСуммыБюджета.Факт );
	//Запрос.УстановитьПараметр("ПроцентНачисления", 		Объект.ПроцентНачисления/100);
	
	РезультатЗапроса 	= Запрос.Выполнить().Выгрузить();
	МассивКоэфф 		= РезультатЗапроса.ВыгрузитьКолонку("СуммаБазаРаспределения");
	Если Объект.СуммаВычета <> 0 Тогда
		мВычеты				= РаспределитьПропорционально( Объект.СуммаВычета, 	МассивКоэфф);
	КонецЕсли;
	Для Каждого СтрРЗ ИЗ РезультатЗапроса Цикл
		Индекс					= РезультатЗапроса.Индекс(СтрРЗ);
		Если Объект.СуммаВычета <> 0 Тогда
			СтрРЗ.СуммаВычета 		= мВычеты[Индекс];
		КонецЕсли;
		// %
		СтрРЗ.СуммаНачислено		= Окр( (СтрРЗ.СуммаБазаРаспределения - СтрРЗ.СуммаВычета) * Объект.ПроцентНачисления/100, 2);
		СтрРЗ.СуммаНачисленоВычета	= Окр( СтрРЗ.СуммаВычета * Объект.ПроцентВычета/100, 2);
	КонецЦикла;
	
	
	Док.Начисление.Загрузить( РезультатЗапроса );
	Док.СуммаДокумента = РезультатЗапроса.Итог("СуммаНачислено") + РезультатЗапроса.Итог("СуммаНачисленоВычета");
	
	ЗначениеВРеквизитФормы(Док, "Объект");
КонецПроцедуры

// по реквизиту год задачи
&НаСервере
Процедура ЗаполнитьТаблицуНачисления()
	Док = РеквизитФормыВЗначение("Объект");
	Док.Начисление.Очистить();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА БюджетПоМесяцам.СтатьяСметы = &СтатьяБазы
		|				ТОГДА БюджетПоМесяцам.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаБазаРаспределения,
		|	СУММА(ВЫБОР
		|			КОГДА БюджетПоМесяцам.СтатьяСметы = &СтатьяНачисления
		|				ТОГДА БюджетПоМесяцам.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаРанее,
		|	БюджетПоМесяцам.ЗадачаПроекта,
		|	СУММА(0) КАК СуммаВычета,
		|	СУММА(0) КАК СуммаНачислено,
		|	СУММА(0) КАК СуммаНачисленоВычета
		|ИЗ
		|	РегистрНакопления.БюджетПоМесяцам КАК БюджетПоМесяцам
		|ГДЕ
		|	БюджетПоМесяцам.Месяц = &ПериодРегистрации
		|	И (&ГодПроекта = 0
		|			ИЛИ БюджетПоМесяцам.ЗадачаПроекта.Владелец.ГодПроекта = &ГодПроекта)
		|	И (БюджетПоМесяцам.СтатьяСметы = &СтатьяБазы
		|			ИЛИ БюджетПоМесяцам.СтатьяСметы = &СтатьяНачисления)
		|	И БюджетПоМесяцам.ТипСуммы = &ТипСуммы
		|	И БюджетПоМесяцам.РКО
		|	И (&ГодЗадачи = 0
		|			ИЛИ БюджетПоМесяцам.ЗадачаПроекта.ГодЗадачи = &ГодЗадачи)
		|
		|СГРУППИРОВАТЬ ПО
		|	БюджетПоМесяцам.ЗадачаПроекта";
	
	Запрос.УстановитьПараметр("ГодПроекта", 			Объект.ГодПроекта);
	Запрос.УстановитьПараметр("ГодЗадачи", 				Объект.ГодЗадачи);
	Запрос.УстановитьПараметр("ПериодРегистрации", 		НачалоМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("СтатьяБазы", 			Объект.СтатьяБазыНачисления);
	Запрос.УстановитьПараметр("СтатьяНачисления", 		Объект.СтатьяНачисления);
	Запрос.УстановитьПараметр("ТипСуммы", 				Перечисления.ТипСуммыБюджета.Факт );
	//Запрос.УстановитьПараметр("ПроцентНачисления", 		Объект.ПроцентНачисления/100);
	
	РезультатЗапроса 	= Запрос.Выполнить().Выгрузить();
	МассивКоэфф 		= РезультатЗапроса.ВыгрузитьКолонку("СуммаБазаРаспределения");
	Если Объект.СуммаВычета <> 0 Тогда
		мВычеты				= РаспределитьПропорционально( Объект.СуммаВычета, 	МассивКоэфф);
	КонецЕсли;
	Для Каждого СтрРЗ ИЗ РезультатЗапроса Цикл
		Индекс					= РезультатЗапроса.Индекс(СтрРЗ);
		Если Объект.СуммаВычета <> 0 Тогда
			СтрРЗ.СуммаВычета 		= мВычеты[Индекс];
		КонецЕсли;
		// %
		СтрРЗ.СуммаНачислено		= Окр( (СтрРЗ.СуммаБазаРаспределения - СтрРЗ.СуммаВычета) * Объект.ПроцентНачисления/100, 2);
		СтрРЗ.СуммаНачисленоВычета	= Окр( СтрРЗ.СуммаВычета * Объект.ПроцентВычета/100, 2);
	КонецЦикла;
	
	
	Док.Начисление.Загрузить( РезультатЗапроса );
	Док.СуммаДокумента = РезультатЗапроса.Итог("СуммаНачислено") + РезультатЗапроса.Итог("СуммаНачисленоВычета");
	
	ЗначениеВРеквизитФормы(Док, "Объект");
КонецПроцедуры


&НаСервере
Процедура НачислитьНаСервере()
	ЗаполнитьТаблицуНачисления();
	
КонецПроцедуры

&НаКлиенте
Процедура Начислить(Команда)
	НачислитьНаСервере();
	ЭтаФорма.ОбновитьОтображениеДанных();
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти
